//
//  TermsOfUse.swift
//  Deadzone
//
//  Created by heyji on 2024/08/06.
//

import Foundation

struct TermsOfUse {
    var title: String
    var description: String
}

extension TermsOfUse {
    static var data = [
        TermsOfUse(title: "제1장 총칙", description: 
"""
제1조 (목적)
이 약관은 이미죽은존씨(이하 "사업자"라 한다)에서 제공하는 Deadzone(이하 "서비스"라 한다)의 이용조건 및 절차에
관한 사항을 규정함을 목적으로 합니다.

제2조 (정의)
이 약관에서 사용하는 용어의 정의는 다음 각호와 같습니다.

① ‘서비스’는 사업자가 운영 및 관리하는 온라인 플랫폼(PC, 모바일, 웹사이트, 애플리케이션, 이하 총칭하여 “플랫폼”이라 합니다)에 게시된 사진을 기반으로 한 콘텐츠에 대한 안내에 필요한 정보를 제공하는 서비스 전반을 의미합니다.
② ‘이용자’는 본 약관에 동의하고 플랫폼에 회원가입을 한 자 또는 회원가입을 하려는 자로서 사업자가 플랫폼에서 제공하는 모든 서비스를 지속적으로 이용할 수 있는 지위를 가진 자를 의미합니다.
③ ‘ID’라 함은 플랫폼이 승인하는 문자, 특수문자, 숫자의 조합으로 이루어진 이용자 고유의 이메일 주소를 의미합니다.
④ ‘비밀번호’라 함은 이용자의 개인정보 보호를 위해 회원 자신이 설정한 문자, 특수문자, 숫자 조합으로 이루어진 비밀번호를 의미합니다.
⑤ ‘아카이브’라 함은 이용자가 촬영한 사진 기록을 저장하는 공간을 의미합니다.
⑥ ‘체크아웃’라 함은 이용자가 플랫폼 이용을 일시적으로 중단하는 것을 의미합니다.

제3조 (효력의 발생과 변경)
① 이미죽은존씨는 이용자가 이 약관의 내용을 인지할 수 있도록 서비스 초기 화면에 명시하며, 이용자가 이 약관에 동의함으로써 효력이 발생합니다.
② 이미죽은존씨는 이 약관을 변경할 수 있으며, 변경된 약관은 이용자에게 공지함으로써 효력이 발생됩니다.

제4조 (준용규정)
이 약관에 명시되지 않은 사항은 국내 법령 및 규정에 따라 조치합니다.
"""),
        TermsOfUse(title: "제2장 서비스 이용계약", description: 
"""
제5조 (이용계약의 성립)
이용계약은 이용자가 약관 내용에 동의 후 이용 신청을 하면, 이미죽은존씨가 이러한 신청에 대하여 승인함으로써 성립됩니다.

제6조 (이용 신청)
이용 신청은 Deadzone 서비스를 통하여 이용자가 이미죽은존씨에서 정한 회원 가입 양식에 따라 회원 정보를 기입하여 신청할 수 있습니다.

제7조 (이용 신청의 승낙)
① 이용자가 Deadzone에서 정한 가입 양식의 모든 사항을 정확히 기재하여 이용 신청을 하였을 경우에 승낙합니다.
② 다음 각호에 해당하는 경우에는 이용 승낙을 하지 않을 수 있습니다.
1. ID, 비밀번호, 닉네임을 정해진 가입 양식에 맞지 않게 기재한 경우
2. 이용 신청의 내용을 허위로 기재한 경우
3. 어려움 발생 원인을 허위로 기술하거나 목적과 무관하게 답변한 경우
4. 부정적 감정, 성별, 활동 정보를 정확하게 선택하지 않은 경우
5. 기타 이 항 각호에 준하는 사유로 이용자의 이용 승낙이 곤란한 경우

제8조 (계약사항의 변경)
이용자는 이용 신청시 기재한 사항이 변경되었을 경우에는 Deadzone 서비스 내에서 변경된 사항을 수정해야 합니다.
"""),
        TermsOfUse(title: "제3장 계약 당사자의 의무", description: 
"""
제9조 (사업자의 의무)
사업자 이미죽은존씨는 서비스 제공과 관련해서 알고 있는 이용자의 신상 정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않습니다.
단, 법률의 규정에 의해 국가기관의 요구가 있는 경우, 범죄에 대한 수사상의 목적이 있거나 또는 기타 관계법령에서 정한 절차에 의한 요청이 있을 경우 이미죽은존씨은 그에 상응하는 정보를 해당 기관에 제공할 수 있습니다.

제10조 (이용자의 의무)
① 이용자는 서비스를 이용할 때 다음 각호의 행위를 하지 않아야 합니다.
1. 다른 이용자의 ID를 부정하게 사용하는 행위
2. 범죄와 결부된다고 객관적으로 판단되는 행위
3. 서비스에서 얻은 정보를 복제하여 제3자에게 제공하는 행위
4. 기타 관계법령에 위반되는 행위
② 이용자는 서비스를 이용하여 영업활동을 할 수 없으며, 영업활동에 이용하여 발생한 불이익에 대하여 이미죽은존씨는 책임을 지지 않습니다.
③ 이용자는 서비스의 이용권한, 기타 이용계약상 지위를 타인에게 양도·증여할 수 없으며, 이를 담보로도 제공할 수 없습니다.
"""),
        TermsOfUse(title: "제4장 서비스 이용", description: 
"""
제11조 (이용자 플랫폼에 관한 의무)
① 이용자는 필요에 따라 자신의 방, 편지 보관함, 등록한 개인정보 유지 보수에 대한 관리 책임을 갖습니다.
② 이용자는 이미죽은존씨에서 제공하는 시스템 일부를 임의로 삭제, 변경할 수 없습니다.
③ 이용자는 Deadzone 내 공공질서 및 미풍양속에 위반되는 내용물이나 제3자의 저작권 등 기타 권리를 침해하는 내용물을 등록하는 행위를 하지 않아야 합니다. 만약 이와 같은 내용물을 게재 하였을때 발생하는 불이익에 대한 모든 책임은 회원에게 있습니다.
④ 이용자는 아카이브 공간의 기록을 백업 등 여러 가지 방법으로 본인이 관리하여야 합니다.

제12조 (이용자의 아카이브 내 사진 기록 관리 및 삭제)
효율적인 서비스 운영을 위하여 이용자의 메모리 공간, 메시지 크기, 보관일수 등을 제한할 수 있으며 등록하는 내용이 다음 각 호에 해당하는 경우에는 사전 통지 없이 삭제할 수 있습니다.
1. 공공질서 및 미풍양속에 위반되는 내용인 경우
2. 범죄적 행위에 결부된다고 인정되는 내용인 경우
3. 플랫폼의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우
4. 이용자가 자신의 아카이브에 음란물을 사진 기록으로 저장하는 경우
5. 기타 관계법령에 위반된다고 판단되는 경우

제13조  (이용자의 아카이브 내 사진 기록의 저작권)
이용자의 아카이브 내 사진 기록에 대한 저작권은 게시자 본인에게 있으며 이용자는 서비스를 이용하여 얻은 정보를 가공, 판매하는 행위 등 서비스에 게재된 자료의 상업적 이용을 금합니다.

제14조 (서비스 이용 시간)
서비스의 이용은 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴 1일 24시간을 원칙으로 합니다. 다만 정기 점검 등과 같은 불가피한 사유의 발생 시에는 해당되지 않습니다.

제15조 (서비스 이용 책임)
서비스를 이용하여 해킹, 음란사이트 링크, 상용 S/W 불법 배포 등의 행위를 하여서는 아니 되며 이를 위반으로 인해 발생한 영업활동의 결과 및 손실, 관계 기관에 의한 법적 조치 등에 관해서는 이미죽은존씨는 책임지지 않습니다.

제16조 (서비스 제공의 중지)
다음 각호에 해당하는 경우에는 서비스 제공을 중지할 수 있습니다.
1. 서비스용 설비의 보수 등 공사로 인한 부득이한 경우
2. 전기통신사업법에 규정된 기간 통신 사업자가 전기통신 서비스를 중지했을 경우
3. 시스템 점검이 필요한 경우
4. 기타 불가항력적 사유가 있는 경우
"""),
        TermsOfUse(title: "제5장 계약 해지 및 이용 제한", description: 
"""
제17조 (계약 해지 및 이용 제한)
① 이용자가 이용계약을 해지하고자 하는 때에는 이용자 본인이 인터넷을 통하여 해지 신청을 하여야 하며, Deadzone에서는 본인 여부를 확인 후 조치합니다.
② Deadzone 이용자가 다음 각호에 해당하는 행위를 하였을 경우 사전 통지 없이 이용 계약을 해지하거나 또는 서비스 이용을 중지할 수 있습니다.
1. 타인의 개인정보, 이용자 ID 혹은 비밀번호를 도용 및 부정하게 사용하는 경우
2. 서비스 운영을 고의로 방해한 경우
3. 허위로 가입 신청을 한 경우
4. 같은 사용자가 다른 ID로 이중 등록을 한 경우
5. 공공질서 및 미풍양속에 저해되는 내용을 유포시킨 경우
6. 서비스의 안정적 운영을 방해할 목적으로 다량의 정보를 전송하거나 광고성 정보를 전송하는 경우
7. 정보통신 설비의 오작동이나 정보 등의 파괴를 유발하는 컴퓨터바이러스 프로그램 등을 유포하는 경우
8. 이용자가 자신의 Deadzone 내의 방 또는 편지 등에 음란물을 게재하거나 음란 사이트를 링크하는 경우
9. 기타 관련 법령에 위반된다고 판단되는 경우
"""),
        TermsOfUse(title: "제6장 면책", description: 
"""
제18조 (면책 조항)
① 이미죽은존씨는 이용자가 서비스를 이용하여 얻은 정보 및 자료 등에 대하여 책임지지 않습니다.
② 이미죽은존씨는 이용자가 서비스에 게재한 정보, 자료, 사실의 신뢰도, 정확성 등 기타 어떠한 내용에 관하여서도 책임을 지지 않습니다.

제19조 (재판 관할)
서비스 이용으로 발생한 분쟁에 대해 소송이 제기될 경우 이미죽은존씨는 본청 소재지를 관할하는 법원을 전속 관할법원으로 합니다.

[부칙]
이 약관은 2024년 05월 30일부터 시행합니다.
""")
    ]
}
